In [2]:
import pandas as pd

# Pair programming Intro a Pandas
1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Un DataFrame tiene dos dimensiones (bidimensional),tiene columnas que pueden ser de un tipo diferente cada una, también tiene filas relacionadas con estas columnas. Y una serie tiene solo una dimensión (unidimensional).

Por otro lado, una serie está etiquetada con un índice (numérico o etiquetas), puede contener datos de cualquier tipo (int,float,cadenas...), y se puede crear a partir de listas, arrays de NumPy u otras Series. Mientras que un Dataframe puede ser visto como un conjunto de series que comparten el mismo índice.

2. Contesta a las siguientes preguntas:

- Crea dos listas:
    - Una que se llame "valores" que tenga 7 números aleatorios.

In [3]:
# Forma A)
import random
lista_valores = [random.randint(0,100) for lista_valores in range (7)]
lista_valores

[26, 25, 29, 56, 1, 43, 18]

In [4]:
# Forma B)
import numpy as np
lista_valores_2 =list(np.random.randint(0,100,7))
lista_valores_2

[0, 28, 29, 76, 2, 99, 44]

- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [5]:
lista_indices = ["lunes","martes","miercoles","jueves","viernes","sabado","domingo"]

- A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [6]:
serie_1 = pd.Series(lista_valores, index = lista_indices)
serie_1

lunes        26
martes       25
miercoles    29
jueves       56
viernes       1
sabado       43
domingo      18
dtype: int64

- A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [7]:
dict_resultado = {}
resultado = zip(lista_indices, lista_valores)


for indice,valor in resultado:
    dict_resultado[indice]=valor

print(dict_resultado)

{'lunes': 26, 'martes': 25, 'miercoles': 29, 'jueves': 56, 'viernes': 1, 'sabado': 43, 'domingo': 18}

- Crea una Serie con el diccionario creado en el punto anterior.

In [8]:
serie_resultados = pd.Series (dict_resultado)
serie_resultados

lunes        26
martes       25
miercoles    29
jueves       56
viernes       1
sabado       43
domingo      18
dtype: int64

- ¿Qué forma tiene esta última Serie? ¿Qué tipo de datos tiene?

Tiene dos columnas, una columna de strings y otra de int, y tiene 7 filas

- ¿Qué tamaño tiene?

In [9]:
serie_resultados.size

7

- ¿Cuáles son los índices de la Serie?

In [10]:
serie_resultados.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

- ¿Y los values?

In [11]:
serie_resultados.values

array([26, 25, 29, 56,  1, 43, 18])

- Extrae el valor para el índice "lunes"

In [12]:
serie_resultados["lunes"]

26

- Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [13]:
serie_resultados["lunes": "miercoles"]

lunes        26
martes       25
miercoles    29
dtype: int64

- Extrae el valor para el índice "lunes" y "domingo"

In [14]:
serie_resultados[["lunes","domingo"]]

lunes      26
domingo    18
dtype: int64

# DataFrames
- Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [17]:
array_paises = np.empty((4,3))
array_paises

array([[-3.10503618e+231, -3.11109037e+231,  3.95252517e-323],
       [ 0.00000000e+000,  0.00000000e+000,  0.00000000e+000],
       [ 0.00000000e+000,  0.00000000e+000,  0.00000000e+000],
       [ 0.00000000e+000,  0.00000000e+000,  0.00000000e+000]])

- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [16]:
df_paises = pd.DataFrame(array_paises)
columnas = ["España", "Francia"," Italia"]
df_paises.columns = columnas
df_paises

          España        Francia         Italia
0 -3.105036e+231 -3.111090e+231  3.952525e-323
1   0.000000e+00   0.000000e+00   0.000000e+00
2   0.000000e+00   0.000000e+00   0.000000e+00
3   0.000000e+00   0.000000e+00   0.000000e+00

- Descarga el archivo "medallas" y carga el DataFrame.

In [18]:
df_medallas= pd.read_csv("medallas.csv", index_col= 0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

- Usando el loc extrae todas las columnas de la fila de Tailandia.

In [26]:
df_medallas.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], dtype='int64')

In [32]:
info_Tailandia = df_medallas.loc[7,:]
info_Tailandia

#nota: El índice en éste caso es un número, no una etiqueta. Por eso daba error cuando poníamos 'Tailandia', ya que es una columna

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

- Usando el loc extrae todas las columnas de China e Irán.-

- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán

In [39]:
df_medallas.loc[[1, 4],["Oro", "Plata", "Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

- Usando el iloc extrae la información de la India. Devolved todas las columnas.

- Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [43]:
paises_impar = df_medallas.iloc[1::2, :]
paises_impar

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

- Contesta a las siguientes preguntas:
    - ¿Qué país consiguió más de 200 medallas de oro?
    - ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
    - ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [68]:
# Paises que consiguieron más de 200 medallas de oro:

paises_mas_oro = df_medallas[df_medallas['Oro']>200]
paises_mas_oro

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [67]:
# si queremos mostrar sólo el país, buscamos por etiqueta
paises_mas_oro['País']

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [69]:
#  Paises que consiguieron más de 200 medallas de oro y más de 1000 medallas de Plata:


paises_mas_oro_plata = df_medallas[(df_medallas['Oro'] >200)& (df_medallas['Plata']>1000)]
paises_mas_oro_plata

    País   Oro  Plata  Bronce
2  Japón  1032   1037     985

In [78]:
#¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

paises_mas_oro_bronce = df_medallas[(df_medallas['Oro'] >200)& (df_medallas['Bronce']>700)]
paises_mas_oro_bronce

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

- Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.